app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @school_class = SchoolClass.find_by(id: params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-05 19:15:55.153605"], ["updated_at", "2018-11-05 19:15:55.153605"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params)
    if @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @school_class = SchoolClass.find_by(id: params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-05 19:23:26.443429"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by(id: params[:id])
    if @school_class.update(school_class_params)